In [2]:
import pandas as pd
import numpy as np

In [39]:
((84*3)+76)/4

82.0

In [42]:
a = [44, 67, 45, 76, 72, 84,84,84,84]
b = [63, np.nan, 54, 75, 86, np.nan,56,np.nan,65]
c = [56, 87, 60, 70, 79, 92,70,70,70]

In [43]:
df = pd.DataFrame({'Chemistry':a, 'Physics':b, 'Maths':c})

In [51]:
df

   Chemistry  Physics  Maths
0         44     63.0     56
1         67      NaN     87
2         45     54.0     60
3         76     75.0     70
4         72     86.0     79
5         84      NaN     92
6         84     56.0     70
7         84      NaN     70
8         84     65.0     70

In [45]:
df.isna().sum()

Chemistry    0
Physics      3
Maths        0
dtype: int64

In [53]:
r = df.groupby(['Maths']).mean()

In [54]:
r

       Chemistry    Physics
Maths
56          44.0  63.000000
60          45.0  54.000000
70          82.0  65.333333
79          72.0  86.000000
87          67.0        NaN
92          84.0        NaN

In [59]:
r["Physics"][70]

65.33333333333333

In [63]:
df.loc[7,"Physics"] = r["Physics"][70]

In [64]:
df

   Chemistry    Physics  Maths
0         44  63.000000     56
1         67        NaN     87
2         45  54.000000     60
3         76  75.000000     70
4         72  86.000000     79
5         84        NaN     92
6         84  56.000000     70
7         84  65.333333     70
8         84  65.000000     70

In [1]:
a1 = [1,2,3,4,5]
b1 = ['a','a','a','b','c']

In [3]:
df3 = pd.DataFrame({'C':a1, 'D':b1})

In [4]:
yoo = df3.groupby(['C'])
yoo

In [5]:
yoo.first()

   D
C
1  a
2  a
3  a
4  b
5  c

In [6]:
for y in yoo:
    print(y)

(1,    C  D
0  1  a)
(2,    C  D
1  2  a)
(3,    C  D
2  3  a)
(4,    C  D
3  4  b)
(5,    C  D
4  5  c)

In [7]:
yoo.get_group(1)

   C  D
0  1  a

In [8]:
yoo.first()

   D
C
1  a
2  a
3  a
4  b
5  c

In [66]:
r.filter(like='5')

Empty DataFrame
Columns: []
Index: [56, 60, 70, 79, 87, 92]